config/Catalogs/ЦеныГосРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЦеныГосРеестра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.АССОРТИМЕНТНЫЙ_ПЛАН</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баркод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/ЦеныГосРеестра/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если (Цена = 0) Тогда
		Отказ = Истина;
	Иначе
			ТХТ="ВЫБРАТЬ
			    |	ЦеныГосРеестра.Ссылка
			    |ИЗ
			    |	Справочник.ЦеныГосРеестра КАК ЦеныГосРеестра
			    |ГДЕ
			    |	ЦеныГосРеестра.Производитель = &Производитель
			    |	И ЦеныГосРеестра.Владелец = &Владелец
			    |	И ЦеныГосРеестра.Ссылка <> &Ссылка
				|	И ЦеныГосРеестра.Баркод = &Баркод
			    |	И ЦеныГосРеестра.Цена = &Цена
			    |	И ЦеныГосРеестра.ЦенаВал = &ЦенаВал";
		
		Запрос=Новый Запрос;
		Запрос.Текст=ТХТ;
		Запрос.УстановитьПараметр("Баркод",Баркод);
		Запрос.УстановитьПараметр("Производитель",Производитель);
		Запрос.УстановитьПараметр("Владелец",Владелец);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Цена",Цена);
		Запрос.УстановитьПараметр("ЦенаВал",ЦенаВал);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		
		Если  ТЗ.Количество()>0  Тогда  
			Предупреждение("Уже существует запись в справочнике с таким производителем!",5);
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли;
	
	
КонецПроцедуры
